[
  {
    "front": "Mesopotamia",
    "back": "Alluvial plain between Tigris and Euphrates Rivers"
  },
  {
    "front": "Sumerians",
    "back": "Early creators of Mesopotamian culture. Presence from 5000 b.c.e."
  },
  {
    "front": "City-States",
    "back": "Linked villages forming city-state systems"
  },
  {
    "front": "Akkadian State",
    "back": "Founded by Sargon of Akkad around 2350 b.c.e."
  },
  {
    "front": "Hammurabi",
    "back": "Established Old Babylonian state. Known for Hammurabi's Law Code"
  },
  {
    "front": "Agriculture in Mesopotamia",
    "back": "Challenges: Low rainfall, unpredictable river floods. Improvement: Introduction of irrigation canals (3000 b.c.e.)"
  },
  {
    "front": "Sumerian Culture and Leadership",
    "back": "Succession: Sumerians followed by Semitic-speaking peoples. Leadership: Emergence of lugals (secular leaders)"
  },
  {
    "front": "Trade and Society",
    "back": "Importance: Crucial for obtaining resources. Classes: Free landowners, dependent farmers/artisans, slaves"
  },
  {
    "front": "Religion and Technology",
    "back": "Beliefs: Amalgamation of Sumerian and Semitic beliefs. Technology: Cuneiform writing, irrigation, metallurgy, military advancements"
  },
  {
    "front": "Mesopotamian Achievements",
    "back": "Base-60 system, advances in mathematics, astronomy. Innovations: Wheel, chariots, siege machinery"
  },
  {
    "front": "Nile River",
    "back": "Defines Egypt's geography, 'Gift of the Nile'"
  },
  {
    "front": "Pharaohs",
    "back": "Egyptian kings considered gods on earth"
  },
  {
    "front": "Kingdoms and Pyramids",
    "back": "Periods: Old, Middle, New Kingdoms. Construction: Giza Pyramids (2550–2490 b.c.e.)"
  },
  {
    "front": "Agriculture and Geography",
    "back": "'Black Land' alongside Nile, cyclic worldview. Relying on Nile floods and irrigation"
  },
  {
    "front": "Trade and Society",
    "back": "Trade Partners: Levant, Nubia, Punt. Classes: Distinct, with peasants as the majority"
  },
  {
    "front": "Religion and Technology",
    "back": "Beliefs: Focus on cyclical nature; pharaohs as gods. Technology: Hieroglyphics, cursive script, extensive knowledge"
  },
  {
    "front": "Indus Valley",
    "back": "Flourished: 2600 to 1900 b.c.e."
  },
  {
    "front": "Urban Centers",
    "back": "Harappa and Mohenjo-daro: Major urban centers"
  },
  {
    "front": "Agriculture and Decline",
    "back": "Reliance: Regular flooding of the Indus. Decline: Natural disasters, ecological changes"
  }
]
